load-testing/scenarios/baseline-test.yml
# Cách chạy:
# Bước 1: -set ENABLE_BATCHING = false trong server/src/sockets/documentSocket.ts
#         -Chỉnh các tham số của server\src\middleware\socketRateLimiter.ts
#         -Tắt comment trong server\src\middleware\permissions.ts
# Bước 2: Chạy chương trình (với 2 tabs)
#   Bước 2.1: Tab 1: docker-compose up --build -d
#   Bước 2.2 (Sau khi docker build xong): 
#             Tab 1: cd load-testing
#                    npm run test:baseline
#             Tab 2: docker logs -f collaborative-docs-server-1 
#   Bước 2.3 (Sau khi test xong): 
#             Tab 1: .\compare-reports.ps1
#             Tab 2: docker logs collaborative-docs-server-1 2>&1 | Select-String "\[NO-BATCH\] Saved" | Measure-Object | Select-Object Count

config:
  target: "http://localhost:12345"
  phases:
    - duration: 120  # 2 phút
      arrivalRate: 5  # 5 users mới mỗi giây → ~600 total users
      name: "Baseline Performance Test"
  engines:
    socketio:
      transports: ["websocket"]
      auth:
        userId: "{{ $randomString() }}"
        username: "ArtilleryUser{{ $randomNumber(1, 10000) }}"

scenarios:
  - name: "Collaborative Document Editing"
    engine: socketio
    flow:
      # 1. Connect to Socket.io
      - emit:
          channel: "connection"
      
      # 2. Join document
      - emit:
          channel: "get-document"
          data:
            documentId: "baseline-test-doc-{{ $randomNumber(1, 10) }}"
            documentName: "Baseline Test Document {{ $randomNumber(1, 10) }}"
      
      # 3. Wait for document to load
      - think: 1
      
      # 4. Simulate typing - send changes every 200ms (5 chars/sec)
      - loop:
          - emit:
              channel: "send-changes"
              data:
                ops:
                  - insert: "a"
          - think: 0.2  # 200ms between keystrokes
        count: 50  # Total 50 keystrokes = 10 seconds of typing
      
      # 5. Save document
      - emit:
          channel: "save-document"
          data: "Test content after 50 keystrokes"
      
      # 6. Wait a bit before disconnecting
      - think: 2